Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Finally, let's add a Jakarta REST `ExceptionMapper`:
ja_jp: 最後に、Jakarta REST `ExceptionMapper` を追加しましょう:

source: Finally, let's consider the `/api/users/me` endpoint. As you can see from the source code below, we are trusting only users with the `standardRole` role. We are using `SecurityContext` to get access to the current authenticated Principal and we return the user's name. This information is loaded from the LDAP server.
ja_jp: 最後に、 `/api/users/me` エンドポイントを考えてみましょう。下のソースコードを見ればわかるように、私たちは `standardRole` の役割を持つユーザのみを信頼しています。現在認証されているプリンシパルへのアクセスを得るために `SecurityContext` を使用しており、ユーザー名を返します。この情報は LDAP サーバーから読み込まれます。

source: Finally, let's consider the `/api/users/me` endpoint. As you can see from the source code below, we are trusting only users with the `standardRole` role. We are using `SecurityContext` to get access to the current authenticated Principal, and we return the user's name. This information is loaded from the LDAP server.
ja_jp: 最後に、 `/api/users/me` エンドポイントについて考えてみましょう。以下のソースコードからわかるように、 `standardRole` ロールを持つユーザーのみを信頼しています。 SecurityContext` を使用して、現在認証されている Principal へのアクセスを取得し、そのユーザ名を返しています。この情報は LDAP サーバーから読み込まれます。

source: Finally, let's consider the `/api/users/me` endpoint. As you can see from the source code below, we are trusting only users with the `user` role. We are using `SecurityContext` to get access to the current authenticated Principal and we return the user's name. This information is loaded from the database.
ja_jp: 最後に、 `/api/users/me` エンドポイントを考えてみましょう。下のソースコードを見ればわかるように、 `user` の役割を持つユーザのみを信頼しています。現在認証されているプリンシパルへのアクセスを得るために `SecurityContext` を使用しており、ユーザーの名前を返します。この情報はデータベースから読み込まれます。

source: Finally, let's consider the `/api/users/me` endpoint. As you can see from the source code below, we are trusting only users with the `user` role. We are using `SecurityContext` to get access to the current authenticated Principal, and we return the user's name. This information is loaded from the database.
ja_jp: 最後に、 `/api/users/me` エンドポイントを考えてみましょう。下のソースコードを見ればわかるように、 `user` のロールを持つユーザのみを信頼しています。現在の認証されているプリンシパルへのアクセスを得るために `SecurityContext` を使用しており、ユーザーの名前を返します。この情報はデータベースから読み込まれます。

source: Finally, let's create a Mapper interface:
ja_jp: 最後に、 Mapper インタフェースを作成しましょう:

source: Finally, let's create a class where we put all our extension methods:
ja_jp: 最後に、すべての拡張メソッドを置くクラスを作りましょう。

source: Finally, let's create a resource class with type-safe templates:
ja_jp: 最後に、タイプセーフなテンプレートを使ってリソースクラスを作ってみましょう。

source: Finally, let's create a resource class.
ja_jp: 最後に、リソースクラスを作成してみましょう。

source: Finally, let's create a simple JAX-RS resource to show the last price. Create the `src/main/java/org/acme/jms/PriceResource.java` file with the following content:
ja_jp: 最後に、前回の価格を表示するための簡単なJAX-RSリソースを作成してみましょう。 `src/main/java/org/acme/jms/PriceResource.java` ファイルを以下の内容で作成します。

source: Finally, let's create a simple Jakarta REST resource to show the last price. Create the `src/main/java/org/acme/jms/PriceResource.java` file with the following content:
ja_jp: 最後に、最後の価格を表示するための簡単なJakarta RESTリソースを作成しましょう。以下の内容で `src/main/java/org/acme/jms/PriceResource.java` ファイルを作成します:

source: Finally, let's create the Mapper interface:
ja_jp: 最後に、マッパーインターフェイスを作成しましょう:

source: Finally, let's create the a Mapper interface:
ja_jp: 最後に、マッパーインターフェイスを作成しましょう。

source: Finally, let's start the Podman service listening on the socket previously specified by the `DOCKER_HOST` environment variable.
ja_jp: 最後に、環境変数 `DOCKER_HOST` で指定したソケットをリッスンするPodmanサービスを起動してみましょう。

source: Finally, let's start using it!
ja_jp: いよいよ、使ってみましょう。

source: Finally, lets configure our REST client with apropriate tls configuration name:
ja_jp: 最後に、適切な tls 設定名を使用して REST クライアントを設定します。

source: Finally, make a secured request to /secured/roles-allowed
ja_jp: 最後に、/secured/roles-allowed へのセキュアなリクエストを行います

source: Finally, run the application with `./target/kafka-and-avro-1.0.0-SNAPSHOT-runner`.
ja_jp: 最後に、 `./target/kafka-and-avro-1.0.0-SNAPSHOT-runner` でアプリケーションを実行します。

source: Finally, secured access to `/secured/roles-allowed`
ja_jp: /secured/roles-allowed へのセキュリティーで保護されたアクセス

source: Finally, set `Service entity descriptor` to point to the Okta SAML Integration Metadata URL you noted at the end of the previous step.
ja_jp: 最後に、前の手順の最後に書き留めた Okta SAML Integration Metadata URL を指すように `Service entity descriptor` を設定します。

source: Finally, special thanks to Sanne Grinovero for introducing us to the Leyden team at just the right time, and for his insights and valuable feedback on our work.
ja_jp: 最後に、Sanne Grinovero 氏には、適切なタイミングで Leyden チームに紹介していただき、私たちの仕事に対する洞察と貴重なフィードバックをいただいたことに深く感謝いたします。

source: Finally, the Kubernetes job will be launched every time it is installed in Kubernetes. You can know more about how to run Kubernetes jobs in this https://kubernetes.io/docs/concepts/workloads/controllers/job/#running-an-example-job[document].
ja_jp: 最後に、KubernetesにインストールされるたびにKubernetesジョブが起動されます。Kubernetesのジョブの実行方法については、こちらの link:https://kubernetes.io/docs/concepts/workloads/controllers/job/#running-an-example-job[ドキュメント] で詳しく解説しています。

source: Finally, the Kubernetes job will be launched every time it is installed in Kubernetes. You can know more about how to run Kubernetes jobs in this https://kubernetes.io/docs/concepts/workloads/controllers/job/#running-an-example-job[link].
ja_jp: 最後に、OpenShiftにインストールされる度にKubernetesのJobは毎回起動されます。KubernetesのJobの実行方法については、こちらの link:https://kubernetes.io/docs/concepts/workloads/controllers/job/#running-an-example-job[リンク] で詳しく解説しています。

source: Finally, the Kubernetes job will be launched every time that is installed in OpenShift. You can know more about how to run Kubernetes jobs in this https://kubernetes.io/docs/concepts/workloads/controllers/job/#running-an-example-job[link].
ja_jp: 最後に、OpenShiftにインストールされる度にKubernetesのJobは毎回起動されます。KubernetesのJobの実行方法については、こちらの link:https://kubernetes.io/docs/concepts/workloads/controllers/job/#running-an-example-job[リンク] で詳しく解説しています。

source: Finally, the Kubernetes job will be launched every time that it is installed in OpenShift. For more information about how to run Kubernetes jobs, see https://kubernetes.io/docs/concepts/workloads/controllers/job/#running-an-example-job[Running an example job].
ja_jp: 最後に、Kubernetes JobはOpenShiftにインストールされるたびに起動されます。 Kubernetesジョブの実行方法の詳細については、 link:https://kubernetes.io/docs/concepts/workloads/controllers/job/#running-an-example-job[サンプルジョブの実行] を参照してください。

source: Finally, the LLM processes the <strong>Augmented Prompt</strong>, using the provided context to generate an answer. Alongside the answer, the system can return the retrieved source segments for transparency and verification, though these should be considered supporting context rather than strict citations.
ja_jp: 最後に、LLMは提供されたコンテキストを使用して回答を生成するため、<strong>オーグメンテーションされたプロンプト</strong>を処理します。回答と並行して、システムは透明性と検証のために検索されたソースセグメントを返すことができますが、これらは厳密な引用ではなく、補助的なコンテキストと見なされるべきです。

source: Finally, the Response is returned to the user, with the option to include the intermediate reasoning steps when transparency is required. Quarkus orchestrates the execution of single- or multi-prompt chains, while LangChain4j supplies the abstractions for building prompts and capturing reasoning outputs at each step. This structured flow improves the LLM’s performance on complex tasks and, when needed, provides an auditable record of how the answer was derived.
ja_jp: 最後に、応答がユーザーに返され、透明性が必要な場合には中間推論ステップを含めるオプションが提供されます。Quarkus はシングルプロンプトまたはマルチプロンプトのチェーンの実行をオーケストレーションし、LangChain4j はプロンプトを構築し、各ステップでの推論出力をキャプチャするための抽象化を提供します。この構造化されたフローにより、複雑なタスクにおける LLM のパフォーマンスが向上し、必要に応じて回答がどのように導き出されたかを示す監査可能な記録が提供されます。

source: Finally, the WASM module configuration goes in application.properties:
ja_jp: 最後に、WASM モジュールの設定を application.properties に記述します。

source: Finally, the `@Authenticated` annotation can be used on specific methods, meaning that only those will require an authenticated user. An example might look like so:
ja_jp: 最後に、 `@Authenticated` アノテーションは特定のメソッドで使用でき、その場合、それらのメソッドのみが認証されたユーザーを必要とします。例は次のようになります。

source: Finally, the `quarkus.http.auth.permission.authenticated` permission is set to tell Quarkus about the paths you want to protect. In this case, all paths are being protected by a policy that ensures that only `authenticated` users are allowed to access. For more information, see xref:security-authorization-of-web-endpoints-reference.adoc[Security Authorization Guide].
ja_jp: 最後に、保護したいパスについてQuarkusに伝えるために、 `quarkus.http.auth.permission.authenticated` パーミッションを設定します。この場合、すべてのパスは、 `authenticated` ユーザーだけがアクセスできるようにするポリシーで保護されています。詳細については、 xref:security-authorization-of-web-endpoints-reference.adoc[セキュリティ認可ガイド] を参照してください。

source: Finally, the `quarkus.http.auth.permission.authenticated` permission is set to tell Quarkus about the paths you want to protect. In this case, all paths are protected by a policy that ensures only `authenticated` users can access them. For more information, see xref:security-authorize-web-endpoints-reference.adoc[Security Authorization Guide].
ja_jp: 最後に、保護するパスについてQuarkusに伝えるために、 `quarkus.http.auth.permission.authenticated` パーミッションを設定します。 この場合、すべてのパスは、 `authenticated` ユーザのみがアクセスできるようにするポリシーによって保護されます。詳細については、 xref:security-authorize-web-endpoints-reference.adoc[セキュリティ認可ガイド] を参照してください。

source: Finally, the `quarkus.jib.jvm-entrypoint` configuration property can be used to completely override the container entry point and can thus be used to either hard code the JVM debug configuration or point to a script that handles the details.
ja_jp: 最後に、 `quarkus.jib.jvm-entrypoint` 設定プロパティを使用して、コンテナのエントリポイントを完全にオーバーライドすることができます。したがって、JVM デバッグ設定をハードコードするか、詳細を処理するスクリプトを指定するために使用できます。

source: Finally, the default OIDC tenant is selected if a tenant id has not been resolved after the preceding steps.
ja_jp: 上記手順の後にテナント ID が解決されていない場合は、最後にデフォルトの OIDC テナントが選択されます。

source: Finally, the filter is attached using the `filter` configuration property of the appropriate handler.
ja_jp: 最後に、適切なハンドラの `filter` 設定プロパティを使用して、フィルタがアタッチされます。

source: Finally, the second-level cache can be disabled globally by setting `hibernate.cache.use_second_level_cache` to `false`; this is a setting that needs to be specified in the `persistence.xml` configuration file.
ja_jp: 最後に、 `hibernate.cache.use_second_level_cache` を `false` に設定することで、L2 キャッシュをグローバルで無効化できます。この設定は、 `persistence.xml` 設定ファイルで指定する必要があります。

source: Finally, the user name `user` is authorized and the security context contains the principal details, for example, the user name.
ja_jp: 最後に、ユーザ名 `user` が認証され、セキュリティコンテキストには、例えばユーザ名などの主要な詳細が含まれます。

source: Finally, the user named `user` is authorized, and the security context contains the principal details, for example, the username.
ja_jp: 最後に、 `user` という名前のユーザーが承認され、セキュリティーコンテキストにはユーザー名などのプリンシパルの詳細が含まれます。

source: Finally, there is one specific thing for AWS Gateway REST API deployments. That API assumes that HTTP response bodies are text unless you explicitly tell it which media types are binary through configuration. To make things easier, the Quarkus extension forces a binary (base 64) encoding of all HTTP response messages and the `sam.yaml` file must configure the API Gateway to assume all media types are binary:
ja_jp: 最後に、AWS Gateway RESTAPIへのデプロイに固有のことが一つあります。そのAPIは、設定でどのメディアタイプがバイナリーであるかを明示的に指定しない限り、HTTPレスポンスボディはテキストであることを想定しています。より簡単にするために、QuarkusエクステンションはすべてのHTTP応答メッセージのバイナリー(ベース64)エンコーディングを強制します。 `sam.yaml` ファイルでは、すべてのメディアタイプがバイナリーであると仮定するようにAPI Gatewayを設定する必要があります。

source: Finally, this guide assumes the use of the link:https://github.com/graalvm/mandrel[Mandrel distribution] of GraalVM for building native executables, and these are built within a container so there is no need for installing Mandrel on the host.
ja_jp: 最後に、このガイドでは、ネイティブ実行可能ファイルのビルド用に GraalVM の link:https://github.com/graalvm/mandrel[Mandrel distribution] の使用を想定しています。これらはコンテナー内にビルドされるため、ホスト上に Mandrel をインストールする必要はありません。

source: Finally, to complete the default tenant resolution, set the following configuration property:
ja_jp: 最後に、デフォルトのテナント解決を完了するには、次の設定プロパティーを設定します。

source: Finally, unused interceptors and decorators are not associated with any bean.
ja_jp: 最後に、未使用のインターセプターとデコレーターは、どのBeanとも関連付けられていません。

source: Finally, use Cloud Run to launch your application.
ja_jp: 最後に、Cloud Runを使ってアプリケーションを起動します。

source: Finally, use `gcloud` to deploy your application as an App Engine service.
ja_jp: 最後に、 `gcloud` を使用して、アプリケーションを App Engine サービスとしてデプロイします。

source: Finally, using `readelf` we can inspect different sections of the binary. For example, we can see how the heap and text sections take most of binary:
ja_jp: 最後に、 `readelf` を使って、バイナリのさまざまなセクションを調べることができます。例えば、ヒープセクションとテキストセクションがバイナリの大半を占めていることがわかります。

source: Finally, using `readelf` we can inspect different sections of the binary. For example, we can see how the heap and text sections take most of the binary:
ja_jp: 最後に、 `readelf` を使って、バイナリーのさまざまなセクションを調べることができます。例えば、ヒープセクションとテキストセクションがバイナリの大半を占めていることがわかります。

source: Finally, using the user `standardUser` works and the security context contains the principal details (username for instance).
ja_jp: 最後に、ユーザー `standardUser` を使用すると動作し、セキュリティーコンテキストには主要な詳細(例えばユーザー名)が含まれています。

source: Finally, using the user `user` works and the security context contains the principal details (username for instance).
ja_jp: 最後に、ユーザー `user` を使用すると動作し、セキュリティーコンテキストには主要な詳細(例えばユーザー名)が含まれています。

source: Finally, we can also generate the cluster wide role resource of "ClusterRole" kind and a "ClusterRoleBinding" resource as follows:
ja_jp: 最後に、以下のように"ClusterRole"種類のクラスタワイドロールリソースと"ClusterRoleBinding"リソースを生成することもできます:

source: Finally, we can create a `ReactiveFruitResource`:
ja_jp: 最後に、 `ReactiveFruitResource` を作成できます。

source: Finally, we create a business process that will make use of this rule and some other activities to approve a given person. Using new item wizard (File -> New -> Other -> BPMN2 Model) create `persons.bpmn` inside `src/main/resources/org/acme/kogito` folder of the generated project.
ja_jp: 最後に、このルールを利用して、指定された人物を承認するビジネスプロセスを作成します。新規項目ウィザード(File -> New -> Other -> BPMN2 Model)を使用して、生成されたプロジェクトの `src/main/resources/org/acme/kogito` フォルダー内に `persons.bpmn` を作成します。

source: Finally, we need to generate the Kubernetes manifests by running the command in a terminal:
ja_jp: 最後に、ターミナルでコマンドを実行して Kubernetes マニフェストを生成する必要があります。

source: Finally, when both ConfigMaps and Secrets are used, the latter always a higher priority than the former.
ja_jp: 最後に、ConfigMapsとSecretsの両方を使用する場合、常に後者の方が前者よりも優先度が高くなります。

source: Finally, when both ConfigMaps and Secrets are used, the latter always has a higher priority than the former.
ja_jp: 最後に、ConfigMapsとSecretsの両方を使用する場合、常に後者の方が前者よりも優先度が高くなります。

source: Finally, when calling the `delete` resource, you should not see any web links as the method `delete` is not annotated with the `@InjectRestLinks` annotation.
ja_jp: 最後に、 `delete` リソースを呼び出すと、 `delete` メソッドに `@InjectRestLinks` アノテーションが付いていないため、ウェブリンクが表示されないはずです。

source: Finally, when calling the delete resource, you should not see any web links as the method `delete` is not annotated with the `@InjectRestLinks` annotation.
ja_jp: 最後に、delete リソースを呼び出すとき、メソッド `delete` には `@InjectRestLinks` アノテーションが付けられていないため、Web リンクは表示されません。

source: Finally, when getting the `MongoCollection` from the database you can use directly the `Fruit` class instead of the `Document` one, the codec will automatically map the `Document` to/from your `Fruit` class.
ja_jp: 最後に、データベースから `MongoCollection` を取得するとき、 `Document` の代わりに `Fruit` クラスを直接使用することができます。codecは自動的に `Document` を `Fruit` クラスにマッピングします。

source: Finally, when the second invocation of the rest client completes, the virtual thread is rescheduled and continues its execution.
ja_jp: 最後に、RESTクライアントの2回目の呼び出しが完了すると、仮想スレッドは再スケジュールされ、実行を継続します。

source: Finally, write a test code the same way as it is described in the <<integration-testing-wiremock, Wiremock>> section above. The only difference is that `@QuarkusTestResource` is no longer needed:
ja_jp: 最後に、上記の <<integration-testing-wiremock, Wiremock>> セクションで説明したのと同じ方法で、テストコードを記述します。唯一の違いは `@QuarkusTestResource` が不要になったことです。

source: Finally, write a test code the same way as it is described in the xref:integration-testing-wiremock[Wiremock] section. The only difference is that `@QuarkusTestResource` is no longer needed:
ja_jp: 最後に、 xref:integration-testing-wiremock[Wiremock] のセクションで説明したのと同じ方法でテストコードを書きます。唯一の違いは、 `@QuarkusTestResource` が不要になったことです:

source: Finally, write the test code as described in the <<code-flow-integration-testing-wiremock,Wiremock>> section. The only difference is that `@QuarkusTestResource` is no longer required:
ja_jp: 最後に、<<code-flow-integration-testing-wiremock,Wiremock>> セクションで説明されているとおりテストコードを作成します。 唯一の違いは、 `@QuarkusTestResource` が不要になったことです。

source: Finally, write the test code, for example:
ja_jp: 最後にテストコードを書きます。例:

source: Finally, write the test code. For example:
ja_jp: 最後にテストコードを記述します。 以下に例を示します。

source: Finally, write your test which will be executed in JVM mode:
ja_jp: 最後に、JVM モードで実行されるテストを作成します。

source: Finally, write your test, which runs in JVM mode:
ja_jp: 最後に、JVM モードで実行されるテストを記述します。

source: Finally, write your test, which will be executed in JVM mode, as shown in the following examples:
ja_jp: 最後に、次の例に示すようにテストを記述します。このテストは JVM モードで実行されます。

source: Finally, you can also provide additional HAL links programmatically in your resource just by returning either `HalCollectionWrapper<T>` (to return a list of entities) or `HalEntityWrapper<T>` (to return a single object) as described in the following example:
ja_jp: 最後に、次の例で説明するように、 `HalCollectionWrapper<T>` (エンティティのリスト) または `HalEntityWrapper<T>` (単一オブジェクト) を返すことで、リソースにプログラム的に追加の HAL リンクを提供することも可能です。

source: Finally, you can also provide additional HAL links programmatically in your resource just by returning either `HalCollectionWrapper` (to return a list of entities) or `HalEntityWrapper` (to return a single object) as described in the following example:
ja_jp: 最後に、次の例で説明するように、 `HalCollectionWrapper` （エンティティのリストを返す） または `HalEntityWrapper` （単一オブジェクトを返す）を返すことで、リソースにプログラム的に追加のHALリンクを提供することも可能です。

source: Finally, you can click *Log Out* image::dev-ui-keycloak-logout.png[alt=Dev UI Keycloak - Log Out,role="center"] so you can authenticate to Keycloak as a different user.
ja_jp: 最後に、*Log Out* image::dev-ui-keycloak-logout.png[alt=Dev UI Keycloak - Log Out,role="center"] をクリックすると、別のユーザーとして Keycloak に認証できるようになります。

source: Finally, you can select a `Log Out` image::dev-ui-keycloak-logout.png option if you'd like to log out and authenticate to Keycloak as a different user.
ja_jp: 最後に、ログアウトして別のユーザーとして Keycloak で認証する場合は、 `Log Out` image::dev-ui-keycloak-logout.png オプションを選択できます。

source: Finally, you do not need to use the OpenShift CLI at all. Instead, set the `quarkus.kubernetes-client.api-server-url` config property and authenticate with the `quarkus.kubernetes-client.token`, or `quarkus.kubernetes-client.username` and `quarkus.kubernetes-client.password` respectively:
ja_jp: 最後に、OpenShift CLIを使用する必要は全くありません。代わりに、 `quarkus.kubernetes-client.api-server-url` configプロパティを設定し、 `quarkus.kubernetes-client.token` 、または `quarkus.kubernetes-client.username` 、 `quarkus.kubernetes-client.password` でそれぞれ認証します：

source: Finally, you don't need to use the OpenShift CLI at all. Instead, set the `quarkus.kubernetes-client.api-server-url` config property and authenticate with the `quarkus.kubernetes-client.token`, or `quarkus.kubernetes-client.username` and `quarkus.kubernetes-client.password` respectively:
ja_jp: 最後に、OpenShift CLIを使用する必要は全くありません。その代わり、 `quarkus.kubernetes-client.api-server-url` の設定プロパティを設定し、 `quarkus.kubernetes-client.token` 、または `quarkus.kubernetes-client.username` と `quarkus.kubernetes-client.password` でそれぞれ認証します:

source: Finally, you don't need to use the OpenShift CLI at all. Instead, set the `quarkus.kubernetes-client.master-url` config property and authenticate with the `quarkus.kubernetes-client.token`, or `quarkus.kubernetes-client.username` and `quarkus.kubernetes-client.password` respectively:
ja_jp: 最後に、OpenShift CLI を使用する必要はまったくありません。代わりに、 `quarkus.kubernetes-client.master-url` config プロパティを設定し、 `quarkus.kubernetes-client.token` 、または `quarkus.kubernetes-client.username` と `quarkus.kubernetes-client.password` でそれぞれ認証を行います:

source: Finally, you need to configure your datasource specifically to use the socket factory:
ja_jp: 最後に、ソケットファクトリを使用するために、データソースを特別に設定する必要があります。

source: Finally, you will be redirected back to the Quarkus endpoint which will return the following response: `Hello, auth0|60e5a305e8da5a006aef5471`
ja_jp: 最後に、Quarkus エンドポイントにリダイレクトされ、次のレスポンスが返されます。 `Hello, auth0|60e5a305e8da5a006aef5471`

source: Finally, you will need to make sure that the Hibernate ORM entities added by Hibernate Search (to represent the outbox and agents) have corresponding tables/sequences in your database:
ja_jp: 最後に、Hibernate Searchによって追加されたHibernate ORMエンティティ（アウトボックスとエージェントを表す）が、データベース内に対応するテーブル/シーケンスを持っていることを確認する必要があります:

source: Find all beans annotated with `@TestAnnotation`.
ja_jp: `@TestAnnotation` でアノテーションが付けられたすべての Bean を検索します。

source: Find all classes annotated with `@Scheduled`.
ja_jp: `@Scheduled` でアノテーションされたすべてのクラスを検索

source: Find more info about Mutiny and its usage in Quarkus on xref:mutiny-primer.adoc[Mutiny support documentation].
ja_jp: Mutinyと、Quarkusでの使用に関する詳細は、 link:mutiny-primer.html[Mutinyサポートドキュメント]を参照してください。

source: Find or create a `Timer` using the specified id and a `prime` label with the result value, and record the duration captured by the `Timer.Sample`.
ja_jp: 指定された ID と結果値を含む `prime` ラベルを使用して `prime` を検索または作成し、 `Timer.Sample` によってキャプチャされた期間を記録します。

source: Find or create a counter called `example.prime.number` that has a `type` label with the specified value.
ja_jp: 指定された値と `type` ラベルを持つ `example.prime.number` というカウンターを検索または作成します。

source: Find out how Quarkus has been used to deploy application components in Kubernetes, and provision satellite systems such as Vault, adfs and others, with a low memory and CPU footprint, while providing a high level abstraction.
ja_jp: QuarkusがどのようにKubernetesにアプリケーションコンポーネントをデプロイするのに使用されてきたのか、Vaultやadfsなどのサテライトシステムのプロビジョニングを、高レベルの抽象化を行いながら、少ないメモリとCPUのフットプリントで実現したかをご覧ください。

source: Find out how to easily integrate the React and Patternfly GUI frameworks into your projects for development as well as production
ja_jp: ReactとPatternflyのGUIフレームワークを、開発やプロダクションのためにプロジェクトに簡単に統合する方法をご紹介します。

source: Finder methods may return collections of entities
ja_jp: ファインダーメソッドはエンティティのコレクションを返す場合があります

source: Fine tuning endpoints generation
ja_jp: エンドポイント生成の微調整

source: Fine tuning of repository definition
ja_jp: リポジトリー定義の微調整

source: Fine, fine.
ja_jp: わかりました、わかりました。

source: Fine-grained control over the execution model is possible using annotations:
ja_jp: アノテーションを使用すると、実行モデルを細かく制御できます。

source: Fine-tuning of repository definition
ja_jp: リポジトリー定義の微調整

source: Fire the event synchronously.
ja_jp: イベントを同期的に発生させます。

source: First Debugging Steps
ja_jp: 最初のデバッグ手順

source: First add the codestart and update the relevant extension's metadata yml file, and build it all (the codestart and the extension if in core).
ja_jp: まず、codestartを追加し、関連するエクステンションのメタデータymlファイルを更新し、すべて（coreの場合はcodestartとエクステンション）をビルドします。

source: First attempts
ja_jp: 最初の試み

source: First build a native executable:
ja_jp: まず、ネイティブ実行可能ファイルをビルドします。

source: First build the Java artifacts:
ja_jp: まず、Javaアーティファクトをビルドします。

source: First click on `Get Advanced Access` to switch `public_profile` to advanced access. Then enter your `Redirect URIs` (set to `<host>/facebook`) and press `Save changes`:
ja_jp: まず、 `Get Advanced Access` をクリックして、 `public_profile` を詳細アクセスに切り替えます。 次に、 `Redirect URIs` を入力します (<host>/facebook`) をクリックし、 `Save changes` を押します。

source: First compile it:
ja_jp: まずコンパイルします。
